magento/magento-connector/magento-connector-1.0.0/org.wso2.carbon.connector/src/test/resources/artifacts/ESB/config/soapRequests/magento/api_createInvoice_optional_setCartShippingMethod.xml

<soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:urn="urn:Magento">
	<soapenv:Header />
	<soapenv:Body>
		<urn:shoppingCartShippingMethod soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
			<sessionId xsi:type="xsd:string">%s(sessionId)</sessionId>
			<quoteId xsi:type="xsd:int">%s(createInvoiceOptionalQuoteId)</quoteId>
			<method xsi:type="xsd:string">%s(cartShippingMethod)</method>
			<storeId xsi:type="xsd:string">%s(storeId)</storeId>
		</urn:shoppingCartShippingMethod>
	</soapenv:Body>
</soapenv:Envelope>